007_case/002_cyclicAMI_run/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      epsilon;
}
dimensions [0 2 -3 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    ball
    {
        type epsilonWallFunction;
        value uniform 0.0;
    }
    inlet
    {
        type fixedValue;
        value uniform 0.01;
    }
    outlet
    {
        type zeroGradient;
    }
    out_wall
    {
        type zeroGradient;
    }
}
